Revit 2023 API
FilterNumericLess Methods
The FilterNumericLess type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from FilterNumericRuleEvaluator.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Evaluate(Int32, Int32)
 Derived classes should override this method to implement the desired test.
 (Inherited from FilterNumericRuleEvaluator.)
Evaluate(Double, Double, Double)
 Derived classes override this method to implement the test that determines whether the two given double-precision values satisfy the desired condition or not.
 (Inherited from FilterNumericRuleEvaluator.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FilterNumericLess Class
Autodesk.Revit.DB Namespace